; domain
(define (domain zeno-travel)
(:requirements :typing :strips)
(:types transportable city flevel - object
        aircraft person - transportable)

(:predicates (at ?x - transportable ?c - city)
             (in ?a - aircraft ?p - person)
	     (fuel-level ?a - aircraft ?l - flevel)
	     (next ?l1 - flevel ?l2 - flevel))


(:action board
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (at ?a ?c)
                 (at ?b ?c))
 :effect (and (not (at ?a ?c))
              (in ?a ?b)))

(:action debark
 :parameters (?a - person ?b - aircraft ?c - city)

 :precondition (and (in ?a ?b)
                 (at ?b ?c))
 :effect (and (not (in ?a ?b))
              (at ?a ?c)))

(:action fly
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d))
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?e)))

(:action zoom
 :parameters (?a - aircraft ?b - city ?c - city ?d - flevel ?e - flevel ?f - flevel)

 :precondition (and (at ?a ?b)
                 (fuel-level ?a ?d)
		 (next ?e ?d)
		 (next ?f ?e)
		)
 :effect (and (not (at ?a ?b))
              (at ?a ?c)
              (not (fuel-level ?a ?d))
              (fuel-level ?a ?f)
	)
)

(:action refuel
 :parameters (?a - aircraft ?b - city ?c - flevel ?d - flevel)

 :precondition (and (fuel-level ?a ?c)
                 (next ?c ?d)
                 (at ?a ?b))
 :effect (and (fuel-level ?a ?d) (not (fuel-level ?a ?c))))


)

; problem
(define (problem ZTRAVEL-3-10)
(:domain zeno-travel)
(:objects
	plane1 - aircraft
	plane2 - aircraft
	plane3 - aircraft
	person1 - person
	person2 - person
	person3 - person
	person4 - person
	person5 - person
	person6 - person
	person7 - person
	person8 - person
	person9 - person
	person10 - person
	city0 - city
	city1 - city
	city2 - city
	city3 - city
	city4 - city
	city5 - city
	city6 - city
	city7 - city
	city8 - city
	city9 - city
	city10 - city
	fl0 - flevel
	fl1 - flevel
	fl2 - flevel
	fl3 - flevel
	fl4 - flevel
	fl5 - flevel
	fl6 - flevel
	)
(:init
	(at plane1 city10)
	(fuel-level plane1 fl1)
	(at plane2 city0)
	(fuel-level plane2 fl4)
	(at plane3 city9)
	(fuel-level plane3 fl2)
	(at person1 city4)
	(at person2 city0)
	(at person3 city6)
	(at person4 city7)
	(at person5 city0)
	(at person6 city3)
	(at person7 city2)
	(at person8 city8)
	(at person9 city0)
	(at person10 city0)
	(next fl0 fl1)
	(next fl1 fl2)
	(next fl2 fl3)
	(next fl3 fl4)
	(next fl4 fl5)
	(next fl5 fl6)
)
(:goal (and
	(at plane3 city5)
	(at person1 city10)
	(at person2 city0)
	(at person3 city3)
	(at person4 city5)
	(at person5 city8)
	(at person6 city5)
	(at person7 city6)
	(at person8 city6)
	(at person9 city5)
	(at person10 city5)
	))

)

; plan
1. (fly plane3 city9 city2 fl2 fl1)
   deleted: (at plane3 city9) (fuel-level plane3 fl2)
   added: (at plane3 city2) (fuel-level plane3 fl1)
   goals met: 1 of 11
2. (board person7 plane3 city2)
   deleted: (at person7 city2)
   added: (in person7 plane3)
   goals met: 1 of 11
3. (board person9 plane2 city0)
   deleted: (at person9 city0)
   added: (in person9 plane2)
   goals met: 1 of 11
4. (board person5 plane2 city0)
   deleted: (at person5 city0)
   added: (in person5 plane2)
   goals met: 1 of 11
5. (zoom plane2 city0 city8 fl4 fl3 fl2)
   deleted: (at plane2 city0) (fuel-level plane2 fl4)
   added: (at plane2 city8) (fuel-level plane2 fl2)
   goals met: 1 of 11
6. (board person8 plane2 city8)
   deleted: (at person8 city8)
   added: (in person8 plane2)
   goals met: 1 of 11
7. (debark person5 plane2 city8)
   deleted: (in person5 plane2)
   added: (at person5 city8)
   goals met: 2 of 11
8. (fly plane3 city2 city5 fl1 fl0)
   deleted: (at plane3 city2) (fuel-level plane3 fl1)
   added: (at plane3 city5) (fuel-level plane3 fl0)
   goals met: 3 of 11
9. (refuel plane3 city5 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 3 of 11
10. (zoom plane2 city8 city5 fl2 fl1 fl0)
   deleted: (at plane2 city8) (fuel-level plane2 fl2)
   added: (at plane2 city5) (fuel-level plane2 fl0)
   goals met: 3 of 11
11. (refuel plane2 city5 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 3 of 11
12. (debark person9 plane2 city5)
   deleted: (in person9 plane2)
   added: (at person9 city5)
   goals met: 4 of 11
13. (fly plane2 city5 city6 fl1 fl0)
   deleted: (at plane2 city5) (fuel-level plane2 fl1)
   added: (at plane2 city6) (fuel-level plane2 fl0)
   goals met: 4 of 11
14. (debark person8 plane2 city6)
   deleted: (in person8 plane2)
   added: (at person8 city6)
   goals met: 5 of 11
15. (board person3 plane2 city6)
   deleted: (at person3 city6)
   added: (in person3 plane2)
   goals met: 5 of 11
16. (refuel plane2 city6 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 5 of 11
17. (fly plane2 city6 city3 fl1 fl0)
   deleted: (at plane2 city6) (fuel-level plane2 fl1)
   added: (at plane2 city3) (fuel-level plane2 fl0)
   goals met: 5 of 11
18. (board person6 plane2 city3)
   deleted: (at person6 city3)
   added: (in person6 plane2)
   goals met: 5 of 11
19. (refuel plane2 city3 fl0 fl1)
   deleted: (fuel-level plane2 fl0)
   added: (fuel-level plane2 fl1)
   goals met: 5 of 11
20. (debark person3 plane2 city3)
   deleted: (in person3 plane2)
   added: (at person3 city3)
   goals met: 6 of 11
21. (fly plane2 city3 city5 fl1 fl0)
   deleted: (at plane2 city3) (fuel-level plane2 fl1)
   added: (at plane2 city5) (fuel-level plane2 fl0)
   goals met: 6 of 11
22. (debark person6 plane2 city5)
   deleted: (in person6 plane2)
   added: (at person6 city5)
   goals met: 7 of 11
23. (fly plane1 city10 city0 fl1 fl0)
   deleted: (at plane1 city10) (fuel-level plane1 fl1)
   added: (at plane1 city0) (fuel-level plane1 fl0)
   goals met: 7 of 11
24. (board person10 plane1 city0)
   deleted: (at person10 city0)
   added: (in person10 plane1)
   goals met: 7 of 11
25. (refuel plane1 city0 fl0 fl1)
   deleted: (fuel-level plane1 fl0)
   added: (fuel-level plane1 fl1)
   goals met: 7 of 11
26. (fly plane3 city5 city6 fl1 fl0)
   deleted: (at plane3 city5) (fuel-level plane3 fl1)
   added: (at plane3 city6) (fuel-level plane3 fl0)
   goals met: 6 of 11
27. (refuel plane3 city6 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 6 of 11
28. (debark person7 plane3 city6)
   deleted: (in person7 plane3)
   added: (at person7 city6)
   goals met: 7 of 11
29. (fly plane3 city6 city4 fl1 fl0)
   deleted: (at plane3 city6) (fuel-level plane3 fl1)
   added: (at plane3 city4) (fuel-level plane3 fl0)
   goals met: 7 of 11
30. (refuel plane3 city4 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 7 of 11
31. (board person1 plane3 city4)
   deleted: (at person1 city4)
   added: (in person1 plane3)
   goals met: 7 of 11
32. (fly plane3 city4 city10 fl1 fl0)
   deleted: (at plane3 city4) (fuel-level plane3 fl1)
   added: (at plane3 city10) (fuel-level plane3 fl0)
   goals met: 7 of 11
33. (refuel plane3 city10 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 7 of 11
34. (debark person1 plane3 city10)
   deleted: (in person1 plane3)
   added: (at person1 city10)
   goals met: 8 of 11
35. (fly plane1 city0 city5 fl1 fl0)
   deleted: (at plane1 city0) (fuel-level plane1 fl1)
   added: (at plane1 city5) (fuel-level plane1 fl0)
   goals met: 8 of 11
36. (debark person10 plane1 city5)
   deleted: (in person10 plane1)
   added: (at person10 city5)
   goals met: 9 of 11
37. (fly plane3 city10 city7 fl1 fl0)
   deleted: (at plane3 city10) (fuel-level plane3 fl1)
   added: (at plane3 city7) (fuel-level plane3 fl0)
   goals met: 9 of 11
38. (refuel plane3 city7 fl0 fl1)
   deleted: (fuel-level plane3 fl0)
   added: (fuel-level plane3 fl1)
   goals met: 9 of 11
39. (board person4 plane3 city7)
   deleted: (at person4 city7)
   added: (in person4 plane3)
   goals met: 9 of 11
40. (fly plane3 city7 city5 fl1 fl0)
   deleted: (at plane3 city7) (fuel-level plane3 fl1)
   added: (at plane3 city5) (fuel-level plane3 fl0)
   goals met: 10 of 11
41. (debark person4 plane3 city5)
   deleted: (in person4 plane3)
   added: (at person4 city5)
   goals met: 11 of 11
